app/views/check_lists/index.slim

SELECT "check_lists".* FROM "check_lists"
---
          tbody
            - s.check_lists.each do |c|