app/controllers/admin_controller.rb

SELECT "projects".* FROM "projects"
SELECT "components".* FROM "components"  WHERE "components"."project_id" = 1
SELECT "test_objects".* FROM "test_objects"  WHERE "test_objects"."project_id" = 1
---
  def index
    @test_objects = TestObject.where(component_id: @current_state.component)
    @projects = Project.all
    @components = Component.where(project_id: @current_state.project)