app/controllers/cases_controller.rb

SELECT "cases".* FROM "cases"
---
  def index
    @cases = Case.all

SELECT  "cases".* FROM "cases"  WHERE "cases"."id" = 1  ORDER BY "cases"."id" ASC LIMIT 1
SELECT "case_steps".* FROM "case_steps"  WHERE "case_steps"."case_id" = 1
---
  def case_with_steps
    @case = Case.where(:id => params[:id]).first
    @steps = CaseStep.where(:case_id => @case.id)

INSERT INTO "cases" ("comment", "created_at", "objective", "planned_duration", "preconditions", "priority", "suite_id", "tags", "test_data", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @case = Case.new(case_params)

    respond_to do |format|
      if @case.save