app/controllers/case_steps_controller.rb

  def create
    @case_step = CaseStep.new(case_step_params)

    respond_to do |format|
      if @case_step.save
---
INSERT INTO "case_steps" ("case_id", "created_at", "step", "step_result", "updated_at") VALUES (?, ?, ?, ?, ?)