app/controllers/check_lists_controller.rb

  def index
  	@check_lists = CheckList.all
---
SELECT "check_lists".* FROM "check_lists"