app/controllers/check_lists_controller.rb

SELECT "suites".* FROM "suites"  WHERE "suites"."component_id" = 1
---
  def index
    @suites_list = Suite.where(component_id: @component_state)

SELECT "suites".* FROM "suites"  WHERE "suites"."component_id" = 1
---
  def new
    @check_list = CheckList.new
    @suites_list = Suite.where(component_id: @component_state)

SELECT  "suites".* FROM "suites"  WHERE "suites"."component_id" = 1  ORDER BY "suites"."id" ASC LIMIT 1
---
  def edit
    @suites_list = Suite.where(component_id: @component_state)

INSERT INTO "check_lists" ("created_at", "description", "priority", "tags", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-03-03 08:34:19.106277"], ["description", ""], ["priority", "high"], ["tags", ""], ["title", "Авторизация в системе"], ["updated_at", "2015-03-03 08:34:19.106277"]]
---
  def create
    @check_list = CheckList.new(check_list_params)

    respond_to do |format|
      if @check_list.save

UPDATE "check_lists" SET "suite_id" = ?, "updated_at" = ? WHERE "check_lists"."id" = 1  [["suite_id", 2], ["updated_at", "2015-03-02 09:53:02.651602"]]
---
  def update
    respond_to do |format|
      if @check_list.update(check_list_params)

DELETE FROM "check_lists" WHERE "check_lists"."id" = ?  [["id", 1]]
---
  def destroy
    @check_list.destroy

SELECT  "check_lists".* FROM "check_lists"  WHERE "check_lists"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_check_list
      @check_list = CheckList.find(params[:id])