app/controllers/components_controller.rb

  def index
    @component = Component.all
---
SELECT "components".* FROM "components"

  def new
    @component = Component.new
    @projects = Project.all
---
SELECT  "projects".* FROM "projects"   ORDER BY "projects"."id" DESC LIMIT 1

  def edit
    @projects = Project.all
---
SELECT "projects".* FROM "projects"

  def create
    @component = Component.new(component_params)

    respond_to do |format|
      if @component.save
---
INSERT INTO "components" ("project_id", "title") VALUES (?, ?)  [["project_id", 1], ["title", "Консоль администратора"]]

    def set_component
      @component = Component.find(params[:id])
---
SELECT  "components".* FROM "components"  WHERE "components"."id" = ? LIMIT 1  [["id", 32]]