app/controllers/current_state_controller.rb

SELECT  "current_states".* FROM "current_states"   ORDER BY "current_states"."id" ASC LIMIT 1
---
  def show
    @current_state = CurrentState.first

UPDATE "current_states" SET "component" = ?, "project" = ? WHERE "current_states"."id" = 1  [["component", "12"], ["project", "5"]]
---
  def update
    respond_to do |format|
      if @current_state.update(current_state_params)

SELECT  "current_states".* FROM "current_states"  WHERE "current_states"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_current_state
    @current_state = CurrentState.find(params[:id])