app/controllers/executions_controller.rb

  def new
    @execution = Execution.new
    @types = ExecutionTypes.all
    @test_objects = TestObject.where(project_id: @current_state.project)
    @component = Component.find_by(id: @current_state.component)
---
SELECT "execution_types".* FROM "execution_types"
SELECT "test_objects".* FROM "test_objects"  WHERE "test_objects"."project_id" = 1
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = 1  ORDER BY "projects"."id" ASC LIMIT 1
SELECT "test_objects".* FROM "test_objects"  WHERE "test_objects"."component_id" = 1