app/controllers/main_controller.rb

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = 4  ORDER BY "projects"."id" ASC LIMIT 1
---
    end

    @all = []
    components = Project.find_by_id(current_state.project.id).components