app/controllers/projects_controller.rb

  def list
    projects = Project.all
---
SELECT "projects".* FROM "projects"

  def components
    components = Component.where(project_id: params[:id])
---
SELECT "components".* FROM "components"  WHERE "components"."project_id" IN ('params')

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-02-25 10:02:48.700419"], ["title", "Модернизация АИТ"], ["updated_at", "2015-02-25 10:02:48.700419"]]

    def set_project
      @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = 4  ORDER BY "projects"."id" ASC LIMIT 1