app/controllers/suites_controller.rb

SELECT "suites".* FROM "suites"  WHERE "suites"."component_id" = 1
---
  def index
    @suites = Suite.where(component_id: @component_state)