app/controllers/suites_controller.rb

  def index
    @suites = Suite.all
---
SELECT "suites".* FROM "suites"

  def new
    @suite = Suite.new
    @components = Component.where(id: Project.where(id: CurrentState.first.project).first)
---
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = 1  ORDER BY "projects"."id" ASC LIMIT 1
SELECT "components".* FROM "components"  WHERE "components"."project_id" = 1

  def edit
    @components = Component.where(id: Project.where(id: CurrentState.first.project).first)
---
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = 1  ORDER BY "projects"."id" ASC LIMIT 1
SELECT "components".* FROM "components"  WHERE "components"."id" = 1

  def create
    @suite = Suite.new(suite_params)

    respond_to do |format|
      if @suite.save
---
INSERT INTO "suites" ("component_id", "created_at", "priority", "tags", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["component_id", 1], ["created_at", "2015-02-26 09:26:04.140642"], ["priority", "Высокий"], ["tags", ""], ["title", "Аутентификация и авторизация"], ["updated_at", "2015-02-26 09:26:04.140642"]]

  def destroy
    @suite.destroy
---
DELETE FROM "suites" WHERE "suites"."id" = ?  [["id", 1]]

    def set_suite
      @suite = Suite.find(params[:id])
---
SELECT  "suites".* FROM "suites"  WHERE "suites"."id" = ? LIMIT 1  [["id", 1]]