app/controllers/test_objects_controller.rb

  def index
    @test_objects = TestObject.where(project_id: @current_state.project)
---
SELECT "test_objects".* FROM "test_objects"  WHERE "test_objects"."project_id" = 1