app/views/application/_project_modal.slim

            div.col-lg-9
              = f.select :project, [], {}, {id: "projects", class: "form-control"}
---
SELECT  "projects".* FROM "projects"   ORDER BY "projects"."id" DESC LIMIT 1